cases/filterCase/0/fluidVolume/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    channelWalls
    {
        type            MarshakRadiation;
        value           uniform 0;
        T               T;
        emissivity      1;
    }
    inlet
    {
        type            MarshakRadiation;
        value           uniform 0;
        T               T;
        emissivity      1;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    topWalls
    {
        type            MarshakRadiation;
        value           uniform 0;
        T               T;
        emissivity      1;
    }
    outerWalls
    {
        type            MarshakRadiation;
        value           uniform 0;
        T               T;
        emissivity      1;
    }
    tankWalls
    {
        type            MarshakRadiation;
        value           uniform 0;
        T               T;
        emissivity      1;
    }
    fluidVolume_to_solidVolume
    {
        type            MarshakRadiation;
        value           uniform 0;
        T               T;
        emissivity      1;
    }
}


// ************************************************************************* //
