cases/filterCase/0/fluidVolume/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    channelWalls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    inlet
    {
        type            flowRateInletVelocity;
        value           uniform ( 0 0 0 );
        flowRate        0.08;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    topWalls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    outerWalls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    tankWalls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    fluidVolume_to_solidVolume
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
