cases/filterCase/0/solidVolume/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    solidWalls
    {
        type            zeroGradient;
        value           uniform 300;
    }
    solidVolume_to_fluidVolume
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        neighbourFieldName T;
        K               K;
    }
}


// ************************************************************************* //
