cases/filterCase/constant/fluidVolume/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       off;

radiationModel  none;

solverFreq      10;

P1Coeffs
{
    C               C [ 0 0 0 0 0 0 0 ] 0;
}

absorptionEmissionModel binaryAbsorptionEmission;

binaryAbsorptionEmissionCoeffs
{
    model1
    {
        absorptionEmissionModel constantAbsorptionEmission;
        constantAbsorptionEmissionCoeffs
        {
            a               a [ 0 -1 0 0 0 0 0 ] 0.5;
            e               e [ 0 -1 0 0 0 0 0 ] 0.5;
            E               E [ 1 -1 -3 0 0 0 0 ] 0;
        }
    }
    model2
    {
        absorptionEmissionModel cloudAbsorptionEmission;
        cloudAbsorptionEmissionCoeffs
        {
            cloudNames
            (
                reactingCloud1
            );
        }
    }
}

scatterModel    cloudScatter;

cloudScatterCoeffs
{
    cloudNames
    (
        reactingCloud1
    );
}


// ************************************************************************* //
