cases/filterCase/system/fluidVolume/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        tolerance       1e-12;
        relTol          0;
    }
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0;
        nPreSweeps       0;
        nPostSweeps      1;
        smoother         DICGaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        maxIter          15;
    }
    pFinal
    {
        $p;
        tolerance 1e-6;
        maxIter 15;
    }
    /*
    "(U|Yj)"
    {
        solver smoothSolver;
        smoother      DILUGaussSeidel;
        nSweeps       20;
        tolerance     1e-7;
        relTol        0;
        maxIter       20;
    }*/
    "(U|Yj|hs|k|omega|R)"
    {
        solver GAMG;
        smoother DILUGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      1;
        tolerance        1e-7;
        relTol           0;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        maxIter          25;
    }
    /*
    "(k|omega)"
    {
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-8;
        relTol 0;
        maxIter 1000;
    }
    */
    hs
    {
        solver GAMG;
        smoother DILUGaussSeidel;
        nPreSweeps       1;
        nPostSweeps      2;
        tolerance        1e-7;
        relTol           0;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        maxIter          10;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
}
additional
{
}
relaxationFactors
{
    hs              1.0;
    U               0.7;
    k               0.8;
    epsilon         0.8;
    p               0.3;
}

// ************************************************************************* //
